cases/1D/diffusionCorrection/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     scalarTransportFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.7;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression no;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.1;

maxAlphaCo      0.1;

maxCapillaryNum 50;

maxDeltaT       1;

// ************************************************************************* //

functions
{
    maxDeviation
        {
            // Load the library containing the 'coded' functionObject
            libs ("libutilityFunctionObjects.so");
            type coded;
            writeControl  timeStep;
            writeInterval 1;
            // Name of on-the-fly generated functionObject
            name maxDeviation;
            // List of include search directories
            codeOptions
            #{
                -I$(LIB_SRC)/surfMesh/lnInclude 
            #};
            // List of libraries to link with
            codeLibs
            #{
                -lsampling \
                -lsurfMesh 
            #};
            // List of include files
            // codeInclude
            // #{
            //     #include "sampledIsoSurfaceCell.H"
            // #};
            // Code
            codeWrite
            #{
                Info << "--------------------------------" << endl;

                // Concentration field
                const volScalarField& Cliq = mesh().lookupObject<volScalarField>("CLVEthylene");
                dimensionedScalar Csat("Csat", dimMass/dimVolume, 1);
                // volume fraction Field
                const volScalarField& alpha = mesh().lookupObject<volScalarField>("alpha.cyclohexane");
                const volScalarField& difference = mag(Cliq / Csat - alpha);
                // error analysis
                scalar deviation = gSum(difference) / mesh().nCells();
                scalar maxDev = gMax(difference.internalField());
                

                Info << "deviation = " << deviation << endl;
                Info << "maximum deviation = " << maxDev << endl;
                Info << "--------------------------------" << endl;
            #};
        }
}